package org.example;

/**
 * 物品库
 */
public class Inventory {

    // 三星武器：13
    final static String[] weapon_3 = new String[]
            {"弹弓", "神射手之誓", "鸦羽弓", "翡玉法球", "讨龙英杰谭", "魔导绪论", "黑缨枪", "以理服人", "沐浴龙血的剑", "铁影阔剑", "飞天御剑", "黎明神剑", "冷刃"};

    // 四星武器：18
    final static String[] weapon_4 = new String[]
            {"弓藏", "祭礼弓", "绝弦", "西风猎弓", "昭心", "祭礼残章", "流浪乐章", "西风秘典", "西风长枪", "匣里灭辰", "雨裁", "祭礼大剑", "钟剑", "西风大剑", "匣里龙吟", "祭礼剑", "笛剑", "西风剑"};

    // 五星武器：10
    final static String[] weapon_5 = new String[]
            {"弓  阿莫斯之弓", "弓  天空之翼", "法器  四风原典", "法器  天空之卷", "长枪  和璞鸢", "长枪  天空之脊", "双手剑  狼的末路", "双手剑  天空之傲", "单手剑  天空之刃", "单手剑  风鹰剑"};

    // 四星角色：19
    final static String[] role_4 = new String[]
            {"辛焱", "砂糖", "迪奥娜", "重云", "诺艾尔", "班尼特", "菲谢尔", "凝光", "行秋", "北斗", "香菱", "安柏", "雷泽", "凯亚", "芭芭拉", "丽莎", "罗莎莉亚", "早柚", "九条裟罗"};

    // 五星角色：5
    final static String[] role_5 = new String[]
            {"霆霓快雨：刻晴", "星天水镜：莫娜", "冻冻回魂夜：七七", "晨曦的暗面：迪卢克", "蒲公英骑士：琴"};


}
